app/controllers/employees_controller.rb

  def index
    employees = Employee.all
---
SELECT "employees".* FROM "employees"

  def create
    employee = Employee.create(employee_params)

    if employee.save
---
INSERT INTO "employees" ("username", "password_digest", "email", "name", "location_id", "manager_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def show
    employee = Employee.find(params[:id])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    employee = Employee.find(params[:id])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]