app/controllers/events_controller.rb

  def index
    events = Event.all
---
SELECT "events".* FROM "events"

  def show
    event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def update
    event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]