app/controllers/sessions_controller.rb

  def create
    employee = Employee.find_by(email: params[:email].to_s.downcase)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."email" = ? LIMIT ?  [["email", "cody@skookum.com"], ["LIMIT", 1]]