app/controllers/sessions_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."username" = ? LIMIT ?  [["username", "cody"], ["LIMIT", 1]]
---
  def create
    employee = Employee.find_by(username: params[:username].to_s.downcase)